zup/ЗУП_бюджет/src/Documents/СведенияОШтатномРасписанииДляМедРегистра/СведенияОШтатномРасписанииДляМедРегистра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СведенияОШтатномРасписанииДляМедРегистра</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлСформирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УИНОрганизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>28</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ШтатныеЕдиницы</name>
    <attributes>
      <name>ПозицияШтатногоРасписания</name>
      <type>
        <types>CatalogRef.ШтатноеРасписание</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеХарактеристика</name>
      <type>
        <types>CatalogRef.ЭлементыКлассификаторовМедРегистра</types>
      </type>
    </attributes>
    <attributes>
      <name>ДолжностьХарактеристика</name>
      <type>
        <types>CatalogRef.ЭлементыКлассификаторовМедРегистра</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСтавок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПодразделения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

zup/ЗУП_бюджет/src/Documents/СведенияОШтатномРасписанииДляМедРегистра/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает структуру параметров для ограничения регистрации объекта при обмене
// Вызывается ПередЗаписью объекта.
//
// Возвращаемое значение:
//	ОграниченияРегистрации - Структура - Описание см. ОбменДаннымиЗарплатаКадры.ОграниченияРегистрации.
//
Функция ОграниченияРегистрации() Экспорт
	
	ПозицииДокумента = ШтатныеЕдиницы.ВыгрузитьКолонку("ПозицияШтатногоРасписания");
	Возврат ОбменДаннымиЗарплатаКадрыРасширенный.ОграниченияРегистрацииПоПозициямШтатногоРасписания(ЭтотОбъект, ПозицииДокумента, Организация);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполняет документ данными из хранилища.
// Параметры: АдресХранилища - адрес временного хранилища.
Процедура ЗаполнитьИзХранилища(АдресХранилища) Экспорт

	ПараметрыЗаполнения = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	СписокПозиций = ПараметрыЗаполнения.СписокПозицийШтатногоРасписания;
	ДанныеДляЗаполнения = ПараметрыЗаполнения.ДанныеДляЗаполнения;
	
	Если ТипЗнч(ДанныеДляЗаполнения) <> Тип("ТаблицаЗначений") Тогда
		ДанныеДляЗаполнения = ТаблицаИзМассива(ДанныеДляЗаполнения);
	КонецЕсли;
	
	// 1 Скопом весь документ
	Если СписокПозиций=Неопределено Или СписокПозиций.Количество() = 0 Тогда
		
		ЭтотОбъект.ШтатныеЕдиницы.Загрузить(ДанныеДляЗаполнения);
		Возврат;
		
	КонецЕсли;
	
	// 2 Выбранным списком
	Для Каждого Позиция Из СписокПозиций Цикл
		
		СтрокаШтатнойЕдиницы = ШтатныеЕдиницы.Найти(Позиция, "ПозицияШтатногоРасписания");
		Если СтрокаШтатнойЕдиницы = Неопределено Тогда
			СтрокаШтатнойЕдиницы = ШтатныеЕдиницы.Добавить();
		КонецЕсли;
		
		СтрокаДляЗаполнения = ДанныеДляЗаполнения.Найти(Позиция, "ПозицияШтатногоРасписания");
		Если СтрокаДляЗаполнения = Неопределено Тогда
			ШтатныеЕдиницы.Удалить(СтрокаШтатнойЕдиницы);
		Иначе
			ЗаполнитьЗначенияСвойств(СтрокаШтатнойЕдиницы, СтрокаДляЗаполнения);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Функция ТаблицаИзМассива(МассивЗначений)
	
	Таблица = ШтатныеЕдиницы.Выгрузить(Новый Структура("НомерСтроки", ""));
	
	Для Каждого Элемент Из МассивЗначений Цикл
		ЗаполнитьЗначенияСвойств(Таблица.Добавить(), Элемент);
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции	

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ПустаяСтрока(УИНОрганизации) Или УИНОрганизации = "........." Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Идентификатор учреждения должен быть заполнен'"), ЭтотОбъект, "УИНОрганизации", , Отказ);
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "УИНОрганизации");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
